[
  {
    "id": 1,
    "subject": "Heartfelt Condolences on the Loss of Your Daughter",
    "sender": "Commissioner Alan Briggs, Redmarsh Police Department",
    "content": "Dear Detective Hill,\n\nOn behalf of the entire Redmarsh Police Department, I extend our deepest condolences on the tragic passing of your daughter, Roxanne. The news of her untimely accident and passing has shaken us all.\n\nYour unwavering service and dedication to the safety of this city have touched countless lives, and we grieve alongside you in this painful moment. Please know that we stand with you and your family, offering whatever support you may need.\n\nWith profound sympathy,\nCommissioner Alan Briggs",
    "date": "2005-01-20T09:15:00Z"
  },
  {
    "id": 2,
    "subject": "In Deepest Sympathy for Roxanne’s Passing",
    "sender": "Maria Clarke, President, Redmarsh Detective Association",
    "content": "Dear David,\n\nWords cannot fully capture the sorrow we feel at the loss of your beloved daughter, Roxanne. The detective community of Redmarsh mourns with you during this tragic time.\n\nYour legacy of justice and integrity has always inspired us, and we share in your grief as one family. Roxanne will be remembered in our prayers and thoughts, and we are here to provide strength and comfort in whatever way we can.\n\nWith heartfelt sympathy,\nMaria Clarke",
    "date": "2005-01-20T10:00:00Z"
  },
  {
    "id": 3,
    "subject": "My Deepest Condolences",
    "sender": "Mayor Charles Beaumont, City of Redmarsh",
    "content": "Detective Hill,\n\nIt is with a heavy heart that I learned of Roxanne’s tragic passing. As a father myself, I cannot imagine the pain of losing a child, and my thoughts are with you and your family.\n\nYour years of selfless service have made Redmarsh a safer, stronger city. Today, the city mourns with you, not only as its most respected detective but also as a father who has suffered an immeasurable loss.\n\nPlease accept my deepest condolences.\nMayor Charles Beaumont",
    "date": "2005-01-21T11:20:00Z"
  },
  {
    "id": 4,
    "subject": "Keeping You in My Prayers",
    "sender": "Judge Rebecca Lang, Redmarsh High Court",
    "content": "Dear David,\n\nI was devastated to hear of Roxanne’s accident and her passing at Redmarsh Healthcare. Your tireless pursuit of justice has long been a guiding light in my courtroom, and I know how deeply you valued your family.\n\nPlease know you are in my prayers. May you find strength in the love of those around you and comfort in cherished memories of your daughter.\n\nWith deepest sympathy,\nJudge Rebecca Lang",
    "date": "2005-01-20T12:05:00Z"
  },
  {
    "id": 5,
    "subject": "Standing With You in This Time of Grief",
    "sender": "Detective Marcus Reed, Redmarsh Police",
    "content": "David,\n\nMy heart aches for you, my friend. Roxanne’s passing is a loss beyond words. I still remember you speaking of her with such pride, and it pains me deeply to see you face this tragedy.\n\nPlease lean on me and the team during this difficult time. We are here for you, not only as colleagues but as family.\n\nWith brotherhood and sorrow,\nMarcus",
    "date": "2005-01-20T13:10:00Z"
  },
  {
    "id": 6,
    "subject": "We Are With You in This Difficult Time",
    "sender": "Detective Sarah Monroe, Redmarsh Police Department",
    "content": "David,\n\nI was heartbroken to hear about Roxanne’s passing. I cannot imagine the pain you are going through right now. Please know that your colleagues at the precinct are grieving with you.\n\nYou have always been there for us as a mentor and a friend, and now we want to be there for you. Don’t hesitate to lean on us for anything you need.\n\nWith deepest sympathy,\nSarah",
    "date": "2005-01-20T14:00:00Z"
  },
  {
    "id": 7,
    "subject": "Condolences for Your Loss",
    "sender": "Detective Alex Porter, Homicide Unit",
    "content": "Dear David,\n\nI am deeply saddened by the tragic news of Roxanne’s passing. I know how much she meant to you and how proud you always were when you spoke of her.\n\nWe in the homicide unit share in your grief and stand by you during this time. Please remember that you are not alone — your team is your family too.\n\nSincerely,\nAlex",
    "date": "2005-01-21T14:30:00Z"
  },
  {
    "id": 8,
    "subject": "Thinking of You and Your Family",
    "sender": "Detective Hannah Lee, Special Crimes Division",
    "content": "David,\n\nHearing about Roxanne’s accident and passing has left me shaken. I know no words can ease the pain, but I want you to know that we are all thinking of you and your family.\n\nYour strength and resilience have always inspired me in my work. I hope you can find that same strength in the love and support of those around you.\n\nWith sympathy,\nHannah",
    "date": "2005-01-20T15:15:00Z"
  },
  {
    "id": 9,
    "subject": "Our Hearts Go Out to You",
    "sender": "Detective Ryan Brooks, Redmarsh Police Department",
    "content": "David,\n\nMy heart goes out to you and your family during this devastating time. I cannot imagine the loss you are feeling after Roxanne’s passing.\n\nYou have been a rock for all of us in the department, and we want you to know that we will now be your support. Take all the time you need — the job will wait, but your healing comes first.\n\nIn sorrow,\nRyan",
    "date": "2005-01-20T16:05:00Z"
  },
  {
    "id": 10,
    "subject": "Sharing in Your Grief",
    "sender": "Detective Laura Patel, Major Crimes Unit",
    "content": "Dear David,\n\nI was deeply saddened when I heard about Roxanne’s tragic passing. It feels unreal, and I can only imagine the depth of your pain.\n\nPlease know that the entire Major Crimes team is thinking of you. We are with you in grief, and we will be with you in strength when you need it most.\n\nWith heartfelt condolences,\nLaura",
    "date": "2005-01-20T17:00:00Z"
  },
  {
    "id": 11,
    "subject": "Exclusive Offer: 40% Off on Home Security Systems",
    "sender": "SafeHome Security <offers@safehome.com>",
    "content": "Protect your loved ones with our state-of-the-art home security solutions. For a limited time, enjoy 40% off installation and a free smart doorbell camera. Don’t miss this exclusive deal — offer ends soon!",
    "date": "2005-01-13T09:00:00Z"
  },
  {
    "id": 12,
    "subject": "Upgrade Your Ride — New Sedan Launch Sale",
    "sender": "Redmarsh Motors <sales@redmarshmotors.com>",
    "content": "Introducing the 2005 Falcon Sedan: sleek design, unmatched safety features, and an incredible fuel economy. Test drive today and get special financing options with zero down payment.",
    "date": "2005-01-13T16:45:00Z"
  },
  {
    "id": 13,
    "subject": "Detective’s Choice: Coffee Subscription Just for You!",
    "sender": "BrewBox <hello@brewbox.com>",
    "content": "Start your mornings strong with BrewBox. Hand-picked gourmet coffee beans delivered fresh every month. Get 25% off your first 3 orders with code DETECTIVE25.",
    "date": "2005-01-12T07:20:00Z"
  },
  {
    "id": 14,
    "subject": "Stay Fit Anywhere — Portable Gym Kit Inside",
    "sender": "FlexFit Gear <promo@flexfit.com>",
    "content": "No time for the gym? No problem. FlexFit’s portable resistance training kit lets you work out anywhere, anytime. Order today and get a free fitness guide ebook.",
    "date": "2005-01-12T12:30:00Z"
  },
  {
    "id": 15,
    "subject": "Flash Sale: Luxury Watches Up to 70% Off",
    "sender": "ChronoLux <deals@chronolux.com>",
    "content": "Elevate your style with our premium watch collection. This weekend only — save up to 70% on select models. Free 2-day shipping across Redmarsh!",
    "date": "2005-01-11T18:15:00Z"
  },
  {
    "id": 16,
    "subject": "Congratulations! You’re Pre-Approved for the Redmarsh Platinum Card",
    "sender": "Redmarsh Bank <offers@redmarshbank.com>",
    "content": "Enjoy unlimited lounge access, 2x points on dining, and a complimentary concierge service. Apply now to activate your pre-approved Redmarsh Platinum Card. Limited period offer.",
    "date": "2005-03-12T11:45:00Z"
  },
  {
    "id": 17,
    "subject": "Your Exclusive Invite: Detective Rewards Credit Card",
    "sender": "SecurePay Financial <promo@securepay.com>",
    "content": "Earn double cashback on coffee and travel expenses! The Detective Rewards Card is designed for hardworking professionals like you. Activate today and get 5,000 bonus points.",
    "date": "2005-01-12T14:10:00Z"
  },
  {
    "id": 18,
    "subject": "Low Interest, High Rewards — Apply Now!",
    "sender": "NationBank <info@nationbank.com>",
    "content": "Switch to NationBank Visa and enjoy 0% APR for the first year. Plus, get $200 cashback after your first purchase. Don’t miss this chance to save big!",
    "date": "2005-01-12T19:25:00Z"
  },
  {
    "id": 19,
    "subject": "You Won’t Believe This Weight Loss Trick!",
    "sender": "HealthBuzz <noreply@healthbuzz.net>",
    "content": "Doctors hate him! One detective found a strange fruit that burns fat instantly. Click here before this email disappears (just like your belly fat).",
    "date": "2005-01-20T08:05:00Z"
  },
  {
    "id": 20,
    "subject": "🚨 URGENT: Your Refrigerator’s Warranty Has Expired",
    "sender": "HomeCare Warranties <alerts@homecare.com>",
    "content": "Don’t risk it! Renew your refrigerator’s extended warranty today and save hundreds on unexpected repairs. Offer valid until midnight tonight.",
    "date": "2005-05-08T13:15:00Z"
  },
  {
    "id": 21,
    "subject": "FREE Trip to Redmarsh Islands*",
    "sender": "TravelScam Deals <win@travelscam.com>",
    "content": "Pack your bags! You’ve been selected for an all-expense-paid trip to the Redmarsh Islands. Just provide your credit card info to secure your spot. *Terms and hidden fees definitely apply.",
    "date": "2005-06-07T17:45:00Z"
  },
  {
    "id": 22,
    "subject": "Important: You May Be a Prince",
    "sender": "Nigerian Royalty <prince@lagosfortune.org>",
    "content": "Dearest friend, I am Prince Abiola. I need your help to transfer $15 million. Kindly share your bank details and you will be rewarded handsomely.",
    "date": "2005-07-16T15:00:00Z"
  }
]
